[
  {
    "school_name": "Frederick P. Whiddon College of Medicine at the University of South Alabama",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Our mission is to provide innovative research, education, and clinical care in a culture of excellence, discovery, and scholarship to the next generation of physicians, scientists, and educators to advance patient-centered and equitable healthcare.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "University of Alabama at Birmingham Marnix E. Heersink School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To advance health and healing through patient care, education, and discovery. Vision: To be a leader in making a global impact through innovative care, transformative discovery, and collaborative teaching and learning. Admissions Statement: The UAB Heersink School of Medicine selects applicants poised to become exceptional clinicians, physician-scientists, and medical educators. We seek academically qualified candidates from all backgrounds and experiences who exhibit strong competence in one or more of the following: dedication to serving others, cultural sensitivity, communication skills, teamwork, and leadership. Our holistic admissions process values applicants with a demonstrated interest in serving underserved rural and urban communities, addressing medical disparities, advancing research and innovation, and/or practicing primary care medicine. We are committed to recruiting and training applicants from Alabama, students with close ties to Alabama, and/or students who demonstrate a passion for the mission of the UAB Heersink School of Medicine.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Alice L. Walton School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Alice L. Walton School of Medicine trains physicians who are devoted to transforming the health of medically underserved and rural communities in Arkansas, its surrounding states, and beyond. AWSOM physicians make a difference by pioneering whole health principles, deploying contemporary technologies, and developing novel partnerships to bridge the gaps to high quality medical care and to promote health and well-being for all individuals and communities. Vision: Equip and support physicians and health professionals to successfully tackle the healthcare challenges of the 21st century. Values: -Empathy -Self-Care -Humanism -Entrepreneurialism -Community Focus",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Arkansas for Medical Sciences College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To improve health and increase knowledge through innovative teaching, ground-breaking research, state-of-the-art patient care and outstanding service to Arkansas, our nation and the world. The UAMS College of Medicine leads the way in educating exemplary physicians and translating biomedical discovery into innovative treatments that enable our health care teams to deliver superior medical care. The mission is to improve the health, health care and well-being of Arkansans, others in the region, the nation and other countries in the world by educating current and future health professionals and the public. By providing high quality, innovative patent- and family-centered health care as well as specialty expertise not routinely available in smaller community settings. Core values include commitment to diversity and health equity supported by diversity of UAMS leadership, faculty, staff, and learners to reduce health care disparities in our state, and honor the unique contributions provided by a diversity of values, beliefs, and cultures.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Arizona State University School of Medicine and Advanced Medical Engineering (SOMME)",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Our mission is to cultivate physicians who can integrate their medical expertise with leading-edge engineering skills in a humanistic framework and develop innovative solutions to health care challenges. Our faculty will advance clinical practice and knowledge through education and translational research to deliver a groundbreaking medical education experience that fosters uncompromised excellence in patient care, biomedical discovery, engineering solutions, and an entrepreneurial mindset. Graduates will be equipped to identify, envision, and implement creative answers to the evolving obstacles in health care for their individual patients, communities, and beyond.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "University of Arizona College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The College of Medicine – Tucson trains future physicians to provide high-quality and compassionate care, develops scientists focused on exciting discoveries, and nurtures undergraduate and graduate students interested the many professions in health care and the health sciences.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "University of Arizona College of Medicine - Phoenix",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of Arizona College of Medicine – Phoenix inspires and trains exemplary physicians, scientists and leaders to optimize health and health care in Arizona and beyond. We are uniquely positioned to accelerate the biomedical and economic engines in Phoenix and the State by leveraging our vital relationships with key clinical and community partners. Core Values: Collaboration, Community, Diversity, Excellence, Innovation, Integrity, and Servant Leadership.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "California Northstate University College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To advance the art and science of medicine through education, service, scholarship, social accountability, and wellness.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "California University of Science and Medicine-School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To advance the art and science of medicine through innovative medical education, research, and compassionate healthcare delivery in an inclusive environment that advocates critical thinking, creativity, integrity, and professionalism.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Charles R. Drew University of Medicine and Science College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "• The mission of the College of Medicine is to provide education, research and clinical service in the context of community engagement in order to train physician leaders who promote wellness, who provide care with excellence and compassion, and who are committed to transforming the health of diverse and underserved communities. • Vision Statement: Excellent health and wellness for all in a world without health disparities.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Kaiser Permanente Bernard J. Tyson School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To provide a world-class medical education that ignites a passion for learning, a desire to serve, and an unwavering commitment to improve the health and well-being of patients and communities.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Keck School of Medicine of the University of Southern California",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To ignite discovery through education, research and patient care, optimizing health for individuals, our diverse communities and society as a whole.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Loma Linda University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the School of Medicine is to continue the teaching and healing ministry of Jesus Christ. Our overriding purpose is to foster the formation of Christian physicians, providing whole-person care to individuals, families, and communities. Fulfilling this responsibility requires education, research, service, developing the whole person, and reaching the world.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "Stanford University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To inspire and prepare a diverse group of exceptional physician scientists, scholars, and leaders to transform human health across all communities through pioneering research and discovery, innovative education, and compassionate patient-centered healthcare.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "University of California, Davis, School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Transforming lives by improving health through the combined power of education, research, clinical care, and community. Here our some ways we put our mission into ACTION: Admissions Practices/Priorities-The Office of Admissions conducts holistic training for all individuals involved in admissions, emphasizing their responsibilities, need for confidentiality and other topics including implicit association (bias) and other key factors influencing admissions decisions. All participants take a university provided training related to diversity and inclusion, implicit bias, and anti-racism. UC Davis utilizes a socio-economic disadvantaged score, based on AMCAS information, to attach a numeric value to each applicant’s perseverance, grit, and distance traveled, which becomes part of the holistic admission evaluation. Beginning in 2009, UC Davis has implemented several successful strategies to support enrollment of students from traditionally underrepresented in medicine groups and those who plan to work in medically underserved areas. Students can apply to enroll in: Accelerated Competency-based Education in Primary Care (ACE-PC), a three-year M.D. program designed with Kaiser Permanente to bolster the primary care workforce in California; TEACH-MS, Transforming Education and Community Health for Medical Students, geared for students who want to work in urban underserved areas; REACH, or Reimagining Education to Advance central California Health, for students aspiring to work in the Central Valley; the Rural Program in Medical Education focusing on closing workforce shortages in rural areas of northern California; and Tribal Health PRIME, designed to provide students with the appropriate knowledge and skills to practice medicine in California’s urban and rural tribal communities. COMPADRE or California Oregon Medical Partnership to Address Disparities in Rural Education is a bold partnership to address workforce shortages in Oregon and Northern California by connecting students from underserved tribal, rural and urban communities to rewarding medical school and residency experiences throughout the region. Mission-focused Graduates-Over the past 10 years, over 75% of CHS graduates have matched into primary care residencies. In 2024, US News and World Report ranked UC Davis #4 in the U.S. for Diversity and Tier 1 for Primary Care. Student Life/Support Services-The Office of Student and Resident Diversity supports all students with a focus on groups historically underrepresented in medicine, working to cultivate a safe learning environment in which diversity can be nurtured in an inclusive, accepting and productive manner. This unit is lead by our newly appointed Associate Dean for Diverse and Inclusive Education and Associate Dean for Diverse and Inclusive Learning Communities. The Office of Student Learning and Educational Resources is a comprehensive academic support unit providing assistance to students in developing learning strategies that support their academic success and promote life-long learning. The Office of Student Wellness develops and implements medical student wellness initiatives, fostering collaborations that will lead to a culture of excellence and well-being. The Academic Coaching Program utilizes clinical faculty to anchor and guide students throughout their medical school journey. Coaches help students understand the culture of medicine, their contribution to it, and how to identify and achieve their goals.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of California, Irvine, School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Mission Statement: Discover - Teach - Heal Vision Statement: Powered by discovery and inclusive excellence, UCI School of Medicine will advance individual and population health.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "University of California, Los Angeles David Geffen School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "As the youngest top-10 medical school in the nation, we are a groundbreaking community of problem solvers, caregivers, innovators, and lifelong learners with a noble mission—to heal humankind by delivering leading-edge research, education, patient care, and community engagement. We represent a diverse and collaborative community of innovators, educators, healthcare providers, and life-long learners who are also committed to o Create world leaders in health and science o Discover the basis for health and cures for disease o Optimize health through community partnerships o Heal humankind one patient at a time",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "University of California, Riverside School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the UCR School of Medicine is to improve the health of the people of California and, especially, to serve Inland Southern California by training a diverse workforce of physicians and by developing innovative research and health care delivery programs that will improve the health of the medically underserved in the region and become models to be emulated throughout the state and nation.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of California, San Diego School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the UC San Diego School of Medicine is to provide skilled, compassionate physicians well-trained to practice medicine who are sensitive to the needs of the special populations of our region and the nation. In addition, we strive to build on our exceptional biomedical, behavioral and health services research strengths to extend the boundaries of the art and science of medicine through continued research and the preparation of future academicians. In these ways, we also strive to improve the overall health of the population.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "University of California, San Francisco, School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "UC San Francisco (UCSF) is the leading university dedicated to advancing health worldwide through preeminent biomedical research, graduate-level education in the life sciences and health professions, and excellence in patient care. Within our overarching advancing health worldwide mission, UCSF is devoted at every level to serving the public. UCSF’s commitment to public service dates to the founding of its predecessor institution, Toland Medical College, in 1864. Born out of the overcrowded and unsanitary conditions of Gold Rush-era San Francisco, Toland Medical College trained doctors to elevate the standards of public health in the burgeoning city. By 1873, the University of California acquired the college and forged a partnership with San Francisco General Hospital that continues to this day and serves as a model for delivering leading-edge care at a public safety-net hospital. Today UCSF’s public mission goes beyond San Francisco and delivers a substantial impact on a national and global level by innovating health care approaches for the world’s most vulnerable populations, training the next generation of doctors, nurses, dentists, pharmacists and scientists; supporting elementary and high school education; and translating scientific discoveries into better health for everyone.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "University of Colorado School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the University of Colorado School of Medicine is to provide Colorado, the nation and the world with programs of excellence in: Education: through the provision of educational programs to medical students, allied health students, graduate students, graduate medical education residents and fellows, practicing health professionals and the public at large; Research: through the development of new knowledge in the basic and clinical sciences, as well as in health policy and health care education; Clinical care: through state-of-the-art clinical programs which reflect the unique educational environment of the University, as well as the needs of the patients it serves, and; Community service: through sharing the School's expertise and knowledge to enhance the broader community, including our affiliated institutions, other health care professionals, alumni and other colleagues, and citizens of the state.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Frank H. Netter MD School of Medicine at Quinnipiac University",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Frank H. Netter MD School of Medicine is dedicated to educating current and future physicians to serve our community, as well as our profession. We accomplish this goal in a student-centered, collaborative environment that values compassionate care, integrity and inclusivity, academic excellence and scholarship, adaptability and social responsibility.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Connecticut School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the UConn School of Medicine is innovation, discovery and education. We train the next generation of medical students, residents, specialty fellows, and clinical practitioners in an environment of exemplary patient care, research, and public service.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "Yale School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Yale School of Medicine educates and nurtures creative leaders in medicine and science, promoting curiosity and critical inquiry in an inclusive environment enriched by diversity. We advance discovery and innovation fostered by partnerships across the University, our local community, and the world. We care for patients with compassion, and commit to improving the health of all people.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "George Washington University School of Medicine & Health Sciences",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The George Washington University School of Medicine and Health Sciences is dedicated to improving the health of our local, national, and global communities by: Educating a diverse workforce of tomorrow's leaders in medicine, science, and health sciences. Healing through innovative and compassionate care. Advancing biomedical, translational, and health services delivery research with an emphasis on multidisciplinary collaboration. Promoting a culture of excellence through inclusion, service, and advocacy. As a globally recognized academic medical center, GW embraces the challenge of eliminating health disparities and transforming health care to enrich and improve the lives of those we serve.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Georgetown University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The School of Medicine is heir to the Jesuit traditions of care of the sick and commitment to service and social justice. It embodies the university’s dedication to the pursuit of knowledge in service of the community. The Georgetown medical experience is centered in \"Cura Personalis\" — care for a person’s psychological, spiritual, social well-being in addition to their physical well-being. It lays the groundwork for the intellectual and ethical formation of physician-healers committed to the clinically competent care and well-being of their patients and dedicated to the health needs of the underserved in our society. The result is a community of scholars and healers who are challenged to achieve their personal potential; dedicated to healing the individual patient; committed to serving the healthcare needs of the community and advocating for those who have no voice. Georgetown University School of Medicine (GUSoM) seeks applicants who chose to be active Physician healers, scientists and advocates. Commitment to service to the underserved is a vital part of our admissions criteria and reflective of our Jesuit mission. Racial Justice Committee for Change (RJCC) Led by our values of racial justice and health equity, we are steadfast in our ongoing commitment to eliminate racism in all forms across our campus. We are grateful to the members of the Racial Justice Committee for Change, a dedicated group of students, staff and faculty, for pursuing sustainable change at the School of Medicine and throughout the medical center. Curriculum Our holistic approach to education, the rigorous spirit of inquiry that makes our community and alumni a force for change in the world, our commitment to social justice – all underlies everything we do as an institution with a rich Catholic and Jesuit heritage. Critical thinking, cognitive integration and life-long learning are qualities that are vital to successful medical practice and guided the development of the curriculum. \"Cura Personalis\" refers to and unites courses related to the development of professional skills unique to doctoring that include physical diagnosis, communications and ethics; \"Cura Personalis\" will run throughout all blocks. Community Service: Georgetown University School of Medicine requires each student to complete a minimum of 20 hours of community service prior to graduation. This requirement is rooted in \"Cura Personalis,\" one of the many Jesuit values that Georgetown University upholds in order to offer its students a unique educational experience. This value suggests individualized attention to the needs of the other, distinct respect for his or her unique circumstances and concerns and an appropriate appreciation for his or her particular gifts and insights. By providing service to the greater community, Georgetown medical students go beyond their roles as student physicians and serve others in a broader context. Student Life and Support Services: The Georgetown University School of Medicine is located in a city and institution that will share an integral dynamism with your medical education. At the heart of our nation, the Georgetown University School of Medicine provides students with robust experiences and opportunities, in addition to a well-rounded medical education. GUSoM is committed to ensuring that all students receive educational, spiritual, psychological, and medical support resources to ensure their well-being. For additional information: https://som.georgetown.edu/diversityequityandinclusion/studentorganizations/cover/services/",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Howard University College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Howard University College of Medicine provides students of high academic potential with a medical education of exceptional quality and prepares physicians and other health care professionals to serve the underserved. Particular focus is on the education of disadvantaged students for careers in medicine. Special attention is directed to teaching and research activities that address health care disparities.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Charles E. Schmidt College of Medicine at Florida Atlantic University",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The FAU Schmidt College of Medicine is committed to transforming healthcare in South Florida and beyond through: Training exceptional clinicians and cutting-edge scientists. Driving scientific breakthroughs in discovery, basic and translational research. Inspiring our diverse community to get and stay healthy. Revolutionizing health outcomes through innovative care pathways. Attracting and retaining the best healthcare workforce. Partnering with stakeholders to improve access to care.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Florida International University Herbert Wertheim College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Herbert Wertheim College of Medicine develops highly qualified, community-engaged, socially accountable health care professionals and serves our region, our nation and the greater world through transformative translational research, medical education and clinical programs that drive forward innovations in health care.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Florida State University College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Florida State University College of Medicine will educate and develop exemplary physicians who practice patient-centered health care, discover and advance knowledge, and are responsive to community needs, especially through service to elder, rural, minority, and underserved populations.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Nova Southeastern University Dr. Kiran C. Patel College of Allopathic Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Advancing human health through innovation in medical education, research, patient care and community engagement.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "University of Central Florida College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of Central Florida College of Medicine educates and inspires individuals to be exemplary physicians and scientists, leaders in medicine, scholars in discovery, and adopters of innovative technology to improve the health and well-being of all. Our patient-centered mission is achieved by outstanding medical care and services, groundbreaking research, and leading-edge medical and biomedical education in a diverse environment.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "University of Florida College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The UF College of Medicine strives to improve health care in Florida, our nation, and the world through excellence, superior leadership in education, clinical care, discovery, and service. We advance our mission through a curriculum and learning environment focused on training our students above all to care deeply and well for their patients and for each other. Six core competencies guide the training, assessment and feedback students can expect: medical knowledge, patient care, systems-based practice, professionalism, communication and practice-based, guided learning and improvement. Our curriculum organizes the acquisition of medical knowledge and skills using a systems-based approach that integrates basic sciences, clinical sciences, health systems, social sciences, and wellbeing. Faculty nurture students’ professional identity through structured encounters with standardized patients, longitudinal mentorship both individually and in teams and immersion in real world scenarios. We intend for all of our students to be well-rounded leaders in patient advocacy. UF Health’s wide service area promotes health systems-informed practice and an interdisciplinary, team-based culture. Students have easy access to mentors and teachers in over 100 primary care, advanced specialty and subspecialty services. In addition, our students learn from and practice with social services professionals, attending faculty, trainees and patients, among other team members, to coordinate care, problem-solve and improve patient outcomes. The full campus in Gainesville includes Shands Hospital, a quaternary care facility which serves as UF’s main teaching hospital and five co-located affiliate hospitals including a Veterans Affairs hospital and children’s hospital, six health professions colleges and nine research centers/institutes. UF Health Jacksonville offers a downtown training hospital and multiple inpatient and outpatient practices serving patients throughout North Florida and South Georgia. We also encourage our students to participate in research and discovery across our academic and clinical enterprises. Eleven scholarly tracks offer short and long term research opportunities. A program based on care will not succeed without an environment that also cares for students. Robust student services include a full-time counselor, full-time learning specialist, structured peer-to-peer mentoring program, wellness curriculum and multiple mechanisms for students to contribute to ongoing program improvement. Our mission informs a holistic admissions practice that seeks those who are not only medically informed, but exhibit throughout the application a genuine humanistic drive and a desire to learn and work in intra- and interdisciplinary teams toward a greater good. Successful candidates demonstrate a desire to grow and be challenged personally, academically and professionally. In evaluating the application and interview, we credit the myriad ways that individuals acquire and demonstrate the character, preparation, resilience and skills that contribute to transforming good medical students into excellent physicians. We evaluate the competencies we seek in part by asking applicants to reflect on how their personal values intersect with medicine and to attempt to think like a physician by responding to the narrative of a real patient encounter. As our curriculum emphasizes exceptional patient care within a setting that prioritizes community and student support, the personal attributes that applicants demonstrate are key as we consider who will thrive in and enhance our community.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "University of Miami Leonard M. Miller School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of Miami Miller School of Medicine’s mission is to provide state-of-the-art, translational and evidence-based information to enhance the quality of education, research, and clinical practice, to foster professional growth, to stimulate intellectual (academic) curiosity, and to promote excellence in the delivery of health care in South Florida and internationally. These educational activities will be relevant to medical knowledge, clinical performance, soundly performed research and/or patient outcomes.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "USF Health Morsani College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the Morsani College of Medicine at the University of South Florida is to provide for the education of students and professionals of the health and biomedical sciences through the creation of a scholarly environment that fosters excellence in the lifelong goals of education, research activity and compassionate patient care.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Emory University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "We are committed to recruiting and developing a diverse group of students and innovative leaders in biomedical science, public health, medical education, and clinical care. We foster a culture that integrates leading-edge basic, translational, and clinical research to further the ability to deliver quality health care, predict illness, treat the sick, and promote the health of our patients and our communities. Our mission objectives are as follows: -Provide outstanding educational programs for medical and graduate students and healthcare professionals -Develop outstanding lifelong learners who will provide the highest quality compassionate care and will serve the needs of their communities in the best traditions of our profession -Conduct innovative and collaborative research and integrate this knowledge into the practice of medicine -Advance the early detection, treatment, and prevention of disease -Ensure the highest ethical and professional standards in all endeavors",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Medical College of Georgia at Augusta University",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the Medical College of Georgia (MCG) at Augusta University is to lead the primary & specialty healthcare needs of Georgia & beyond, with an emphasis on caring for underserved communities, by delivering excellence in individualized medical education, transformative research, innovative patient care & community engagement.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Mercer University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of Mercer University School of Medicine (MUSM) is to educate physicians and health professionals to meet the primary care and health care needs of rural, medically underserved areas of Georgia.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "Morehouse School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Morehouse School of Medicine is dedicated to improving the health and well-being of individuals and communities; increasing the diversity of the health professional and scientific workforce; and addressing primary health-care needs through programs in education, research, and service, with emphasis on people of color and the underserved urban and rural populations in Georgia and the nation.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Hawaii, John A. Burns School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "JABSOM, as part of the fabric of Hawai‘i, is a diverse learning community committed to excellence and leadership in: - Educating current and future healthcare professionals and leaders - Delivering high-quality healthcare - Conducting research and translating discoveries into practice - Establishing community partnerships and fostering multidisciplinary collaboration - Pursuing alliances unique to Hawaiʻi and the Asia-Pacific region - Acting with forethought regarding right relationships, respect, and moral action. Each JABSOM student is placed into a Learning Community that provides longitudinal mentorship, support and education as they progress through our curriculum. Curricular and co-curricular activities echo the school's mission statement and students participate in a variety of educational programs the support our communities including those across the State of Hawai'i and the Pacific Basin. Students who are interested in rural health may opt to participate in our Rural Health Track. Global Health experiences are offered to allow students the opportunity to learn in Asia and the Pacific Basin. Our graduates pursue a variety of specialties and many choose primary care specialties. More than half of all physicians practicing in Hawai'i have trained at JABSOM as a medical student, resident or fellow. Members of our JABSOM community engage in outreach efforts to encourage, mentor and provide opportunities to students interested in pursuing careers in healthcare. These outreach efforts emphasize the JABSOM mission. The JABSOM admissions committee members and interviewers participate in annual training workshops that focus on the selection of applicants who are mission-aligned and who are committed to improving the healthcare of our communities.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Iowa Roy J. and Lucille A. Carver College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Admissions Committee for the University of Iowa Roy J. and Lucille A. Carver College of Medicine admits students who have a genuine interest in the study and practice of medicine; show a desire and commitment to serve the public in matters of health; and who have the personal, professional and intellectual skills and characteristics required to become and competent and caring physician. Personal qualities considered by the Admissions Committee include high moral character, independent thinking, the ability to communicate and interact with others in a sensitive and caring way, the ability to maintain professionalism in stressful situations, and dedication to the idea of service. Understanding the importance of the educational benefits resulting from a diverse student population and the interest by the medical profession in serving the healthcare needs of a changing American population, the Admissions Committee values each applicant’s unique strengths, experiences and background. To execute our mission, the committee utilizes a holistic review of all candidates. Our committee values each candidates' different experiences and personal stories and takes into consideration: first generation college students, rural backgrounds and experiences, socioeconomic status, and any other impactful experiences students describe in their application that will make them a compassionate and excellent physician. Please read our sections about Campus Life to learn more about how Carver's mission informs our culture of collaboration and other initiatives.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Carle Illinois College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Carle Illinois College of Medicine is the world’s first engineering-based medical school. We educate exceptional physician-innovators to deliver high-value, compassionate health care through transformative solutions developed at the intersection of engineering, science and medicine. A CI MED physician innovator will be a leader who is trained via interdisciplinary immersion to develop these transformative health care solutions. Our vision is to be a global leader in transformative medical education, research and clinical care innovation, improving the health and well-being of patients and communities around the world. We are driven by key qualities that permeate our culture and result in a self-enhancing environment: • Compassion: We are focused on improving the human condition through compassionate care for patients, society and the world at large. • Competence: We are confident in our capacity to prepare board-certified physicians who are also innovators who will revolutionize healthcare delivery. • Curiosity: Change doesn’t just happen. Through a unique blend of unwavering curiosity, determination and a giant leap into new ways of thinking, we challenge the status quo. • Creativity: We will develop unprecedented solutions to society’s most challenging healthcare delivery problems by collectively building on each other’s creative ideas. • Collaboration: We leverage our strategic partnerships with Carle Health, the University of Illinois. and the community to enhance our innovative curriculum, expand learning opportunities, and advance human health. • Diversity: We actively promote an inclusive environment in which students, faculty, and staff can learn, teach, research, and serve.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "Chicago Medical School at Rosalind Franklin University of Medicine & Science",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Chicago Medical School’s mission is to educate a diverse student body in a community-engaged, interprofessional environment. Our graduates become exemplary, compassionate physicians and scientists dedicated to improving the health and wellness of their patients and communities through clinical excellence, scientific discovery, service, and leadership.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Loyola University Chicago Stritch School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Loyola University Chicago Stritch School of Medicine (SSOM) is committed to scholarship and the education of medical professionals and biomedical scientists. Our school, including its faculty, trainees, and staff are, called to go beyond facts, experimentation, and treatment of disease to prepare people to lead extraordinary lives and treat the human spirit in an environment that encourages innovation embraces diversity, respects life, and values human dignity.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Northwestern University The Feinberg School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Our mission is to impact the practice of medicine through discovery and education to improve human health. Our vision is to achieve this mission through continuous quality improvement. The pursuit of excellence requires a learning organization grounded in leadership, innovation, and compassionate care that can translate new knowledge into better human health. These attributes are interwoven by professionalism dedicated to teamwork, collegiality, and social and intellectual curiosity. Such values promote the best interests of medicine and further strengthen our social contract with the community we serve.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Rush Medical College of Rush University Medical Center",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Rush Medical College (RMC) is one of three colleges within Rush University (RU), the academic arm of the Rush University System for Health (RUSH). The missions of RMC and RU have been adopted in support of RUSH's mission, which is to improve the health of the individuals and diverse communities we serve through the integration of outstanding patient care, education, research, and community partnerships. Rush University champions a learning environment in health and biomedical sciences through collaboration, education, research, and equity for our students, faculty, staff, and the communities we serve. RMC's mission is to nurture, through a supportive and dynamic learning community, the development of empathic, proficient physicians dedicated to continuous learning, innovation, and excellence in clinical practice, education, research, and service. RMC seeks to interview and matriculate applicants who have demonstrated their alignment with the various Rush mission statements through their direct patient care experiences, longitudinal commitments to service, leadership and extracurricular activities, and research endeavors.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Southern Illinois University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the SIU School of Medicine is to optimize the health of the people of central and southern Illinois through education, patient care, research and service to the community. With a Vision of Better health for all.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Chicago Division of the Biological Sciences The Pritzker School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "At the University of Chicago, in an atmosphere of interdisciplinary scholarship and discovery, the Pritzker School of Medicine is dedicated to inspiring diverse students of exceptional promise to become leaders and innovators in science and medicine for the betterment of humanity. --- Our mission statement is an expression of our core purpose and educational philosophy. In particular, it highlights the value we place on service, leadership, the creation of new knowledge, and these values guide both our admissions process and the education that Pritzker students receive. We view our students as future leaders who will make an impact in healthcare and science and are committed to ensuring that our students are well-positioned to successfully pursue the next phase of their training and careers. Our Phoenix Curriculum emphasizes the relationship between the basic/clinical sciences and community/population health while providing students with ample time for self-directed learning, research, community engagement, and training in health equity and medical ethics, while accelerating entry into the clinical clerkships. During phase two of the curriculum, Pritzker students complete the majority of their clinical training at UChicago Medicine (UCM), the only tertiary care center on the South Side of Chicago. UCM is one of the top ten most racially inclusive hospitals in the U.S. ( https://lownhospitalsindex.org/2022-winning-hospitals-racial-inclusivity/ ) with a primary service area of 12 South Side zip codes where poverty is over double the state level. Additionally, our students lead six free clinics in diverse neighborhoods throughout the city of Chicago. Our Admissions Committee values applicants whose personal mission within medicine includes health justice, equitable delivery of healthcare, and service to underserved and marginalized communities. Our students carry this mission beyond their medical school years, and the majority of our students plan to care primarily for underserved populations during their careers in medicine (2023 AAMC Graduation Questionnaire). Our students are also deeply invested in scholarship and discovery, with access to world-renowned, interdisciplinary faculty mentors and experts in basic/translational science, health services/data science, community health, global health, medical education, and clinical research. 100% of our students complete a mentored research project, and faculty and students are supported in scholarship and discovery through focused, funded, and longitudinal research experiences embedded within the core curriculum. At the Pritzker School of Medicine, medical students are valued members of our community. Our robust advising and mentorship structure, commitment to student wellbeing and vitality, and atmosphere of collaboration, support, and excellence ensure that the Pritzker medical student is poised to help shape the future of medicine.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Illinois College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To advance health for everyone through outstanding education, research, clinical care, and social responsibility. Mission in Action: We achieve this mission through an innovative and evolving curriculum that integrates the basic, clinical and social sciences, and through a learning environment that emphasizes self-directed, individualized and experiential learning on three three vibrant campuses that are strategically located to serve the communities of interest for our mission. We prepare our graduates to provide compassionate patient care; to demonstrate effective inter-professional collaboration, leadership and advocacy in health care; to provide care for underserved urban and rural populations; and to translate research discoveries into clinical practice. Our large network of graduates serve in a variety of academic, public, private, rural, and urban communities. Our mission-informed admissions process embraces holistic review where equal consideration is given to experiences, attributes, and metrics and because of our emphasis on our mission we are able to select a cohort of students each year that is broadly diverse with richly varied passions. Our curriculum, educational support, student affairs, and financial aid teams are poised to provide individualized attention for all of our students. To prepare you for your medical career, our curriculum: • helps you make powerful connections between the fundamentals of scientific knowledge and the decision-making of patient care • ensures that you have plenty of skills practice including patient interviewing, clinical reasoning, forming differential diagnoses, and choosing among treatment options • teaches you the problem-solving skills and study skills that will prepare you for the life-long professional skill of medical inquiry • engages in a continuous dialog about developing your professional identity and voice, gaining perspective on patients’ micro and macro barriers to receiving care, and placing medical treatment in the context of health of individuals, families, and communities The College of Medicine recognizes that physicians-in-training must learn how to be effective members of interdisciplinary clinical teams; how to search for up-to-date, credible, professional sources of medical information; and how to navigate the changing landscape of healthcare delivery. The Illinois Medicine Curriculum is the product of our community’s collaborative design process that includes students, faculty who teach medical sciences, faculty who teach clinical medicine, medical education scholars, instructional designers, and experts in assessment and evaluation. It is characterized by • case-based learning as its core • teaching of basic sciences with clinical applications • maximization of active learning • integrated career development and exploration",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Indiana University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The goal of the Indiana University School of Medicine is the education of physicians, scientists, and other health professionals in an intellectually rich environment with research as its scientific base. In education, we are committed to imparting a fundamental understanding of both clinical practice and the basic scientific knowledge upon which it rests, to provide a firm foundation for lifelong learning. In research, we are committed to the advancement of knowledge. In patient care, we are committed to the highest standards of medical practice in an atmosphere of respect and empathy for our patients. Education, research, and delivery of health care are inseparable components of our mission. Excellence can only be achieved when all components are of highest quality, well integrated, and mutually supportive. As the state’s largest medical school, Indiana University School of Medicine is committed to being an institution that not only reflects the diversity of the learners we teach and the patient populations we serve, but also enacts the values of diversity, equity and inclusion that inform academic excellence. We desire candidates who enhance our representational diversity, as well as those whose work contributes to equitable and inclusive learning and working environments for our students, staff, and faculty. Indiana University School Medicine strives to take an anti-racist stance, interrogating its policies, procedures, and practices to ensure equitable opportunities for contribution and advancement for all members of our community. We invite individuals who will join us in our mission to advance social equity to transform health and wellbeing for all throughout the state of Indiana.”",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Kansas School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To improve lives and communities in Kansas and beyond through innovation in education, research and health care.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "University of Louisville School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Improve the health and vitality of our community, our commonwealth, and our world by educating the next generation of physicians and scientists, providing high-quality compassionate care, pursuing transformative research, forging strategic partnerships, and striving for inclusive excellence.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Louisiana State University School of Medicine in New Orleans",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The LSU School of Medicine is dedicated to providing the opportunity for an excellent medical education to all applicants who are prepared to benefit from its curriculum and instruction. To this end, the Admissions Committee will strive to recruit and admit residents from Louisiana from every geographic, economic, social, and cultural dimension of the state of Louisiana and also other states within the country.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Louisiana State University School of Medicine in Shreveport",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The primary mission of Louisiana State University Health Shreveport (LSUHS) is to teach, heal, and discover, in order to advance the wellbeing of the region and beyond. LSUHS comprises the Schools of Medicine, Graduate Studies, and Allied Health Professions in Shreveport. In implementing its mission, LSUHS is committed to: - Educating physicians, scientists, and residents for healthcare service, teaching and research. - Providing state-of-the-art clinical care, including tertiary services, to an enlarging and diverse regional base of patients. - Achieving distinction and international recognition for basic science and clinical research programs that contribute to the practice in science and medicine. - Supporting the region and the State in economic growth and prosperity by utilizing research and knowledge to engage in productive partnerships with the private sector. - Fostering a culture that promotes mutual respect for all.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Tulane University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "We improve human health and foster healthy communities through discovery and translation of the best science into clinical practice and education; to deliver the highest quality patient care and prepare the next generation of distinguished clinical and scientific leaders.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "Boston University Aram V. Chobanian & Edward Avedisian School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Boston University Chobanian & Avedisian School of Medicine is dedicated to the educational, intellectual, professional, and personal development of a diverse group of exceptional students, trainees, and faculty who are deeply committed to the study and to the practice of medicine, to biomedical research, and to the health of the public. We, as a community, place great value on excellence, integrity, service, social justice, collegiality, equality of opportunity, and interdisciplinary collaboration. Chobanian & Avedisian SOM is a social justice medical school. This emphasis on social justice is evident in our curriculum and extra-curricular activities for students, in our faculty’s areas of research and expertise, and in the patients we take care of. Our curriculum was updated several years ago to emphasize patient context and social determinants of health. In the classroom, our patients are never simply a patient with a disease, they are a person with a family who lives in a specific place and does a certain type of work…in the clinical setting, our students learn to address each patient’s upstream health needs as well as their acute medical needs; because we’ve learned that the best medical care in the world will fail to make patients healthier if they still lack food, housing, etc. Outside the classroom, our students’ most common activity is to participate in some of the 17 or so service learning groups, which range from the “Outreach Van” street medicine initiative to the “Teen and Tot” facilitated support group for young parents to the Socially Responsible Surgery Club which allows students to visit surgical patients pre-discharge to ensure their understanding of their surgical problem and procedure and plan for follow-up. A unique feature of our social justice medical school is that we are in the context of a Tier 1 research university. While our research enterprise is very broad, you see the social justice mission thriving there as well. Examples include the Grayken Center for Addiction, which supports research, education and treatment in addition medicine, in the Health/Care Disparities Research Program within internal medicine, and the Boston SOAR (Surgical Outcomes Analysis and Research) which investigates inequalities in surgical care. 85% of our medical students engage in Research during their time at Chobanian & Avedisian SOM. Chobanian & Avedisian SOM’s primary teaching hospital is Boston Medical Center, which serves a primarily under-served and extraordinarily diverse patient population. More than half of our patients are from vulnerable populations who rely on Medicaid and/or medicare for their health insurance; and 32% don’t speak English as their primary language. Through our 12 affiliated neighborhood health centers, we reach deep into the communities of Boston to find the patients that need us the most.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Harvard Medical School",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To nurture a diverse, inclusive community dedicated to alleviating suffering and improving health and well-being for all through excellence in teaching and learning, discovery and scholarship, and service and leadership.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "Tufts University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of Tufts University School of Medicine is to educate a diverse body of students and advance medical knowledge in a dynamic and collaborative environment. We seek to foster the development of dedicated clinicians, scientists, public health professionals, and educators who will have a sustained positive impact on the health of individuals, communities, and the world. To achieve the goals of our mission statement, our faculty, students and staff demonstrate our commitment to the following core values in all that we do: Commitment to Excellence To cultivate a perpetual spirit of inquiry and creativity, leading to outstanding evidence-based health care, rigorous research and scholarship, and inspired teaching. Commitment to Humanism To relieve suffering and improve quality of life. To treat all people with compassion, respecting human dignity and autonomy. Commitment to Social Responsibility To serve and advocate for all people, especially underserved and vulnerable patients and populations, by addressing social determinants of health, health equity, social justice, and stewardship of social resources. Commitment to Professionalism To act in accordance with the highest standards of integrity, demonstrating personal accountability and resilience, collegiality and teamwork, and the pursuit of lifelong learning. Tufts University School of Medicine embraces diversity in the broadest form, including racial, ethnic, religious, socioeconomic, geographic diversity, as well as diversity in gender and sexual orientation. We believe that a diverse student body is essential for the creation of a teaching and learning environment that promotes excellence, quality and equity as core values among our future physicians, scientists and public health advocates, a workforce equipped with the knowledge and skill needed to address the range of health challenges facing our increasingly diverse patient population and their communities. To this end, Tufts School of Medicine is committed to pursuing initiatives that will diversify the applicant pool and improve the selection process in order to create the most diverse student body.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Massachusetts T.H. Chan School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of UMass Chan Medical School is to advance the health and well-being of the people of the commonwealth and the world through pioneering advances in education, research and health care delivery. The UMass Chan Medical School Office of Admissions is committed to employing the most effective and evidence-based methods to recruit and matriculate future physicians and scientists who will provide the highest quality medical care for our communities in keeping with the mission of the T.H. Chan School of Medicine. Our graduates will contribute in a meaningful way to the elimination of health care disparities and the establishment of health equity in Massachusetts and beyond. Our Office of Admissions implements the mission through holistically reviewing each eligible application and placing highest value on applicant characteristics which align with the UMass Chan mission such as commitment to health equity, diversity and inclusion and service to the community. Our VISTA curriculum has an innovative, integrated structure based on foundational, clinical and health systems sciences. The longitudinal focus topics of health equity, societal forces in health and disease and health systems science are woven into all courses and rotations. At UMass Chan, we believe that patients are whole people, not just a collection of organ systems, and must be seen in the context of their lives. Student and health care provider wellness is highly prioritized as evidenced by the “WIN” week which appears at the end of each foundational block. WIN stands for “What I Need” and is an opportunity for students to rest, focus on health and expose themselves to educational enrichment. Our clinical training sites are located across the commonwealth with housing provided where indicated, offering a rich clinical training experience for our learners. In the Exploration Phase, students participate in 12-week integrated units that ensure exposure to inpatient and ambulatory environments in both acute care and chronic disease management. Our Horizons phase focuses on advanced clinical skills and preparation for residency. A unique feature of the VISTA curriculum which is closely aligned with the UMass Chan mission is our pathways. At the main campus in Worcester MA, students will select a pathway for educational focus during their early clinical learning time. These pathways range from “Entrepreneurship Biomedical Innovation and Design” to “Structural Inequity, Advocacy and Justice”. There are two UMass Chan Medical School regional campuses each with their own pathway focus. At our PURCH program at Baystate Health systems, students focus on Population-based Urban and Rural Community Health. Our LEAD@Lahey program at Lahey Health focuses on leadership, innovation, and Health Systems Science. The T.H. Chan School of Medicine mission is woven into everything we do.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Johns Hopkins University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the Johns Hopkins School of Medicine is to prepare physicians to practice compassionate clinical medicine of the highest standard and to identify and solve fundamental questions in the mechanisms, prevention and treatment of disease, in health care delivery and in the basic sciences.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Uniformed Services University of the Health Sciences F. Edward Hebert School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Uniformed Services University School of Medicine trains Army, Navy, Air Force, Coast Guard, and PHS physicians, public health practitioners, psychologists, and biomedical scientists to support our nation’s military and public health systems, the National Security and Defense Strategies of the United States, and the readiness of our Uniformed Services. As the Leadership Academy of Military Medicine, we prepare our students to become outstanding clinical practitioners, researchers, and leaders.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "University of Maryland School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "We pursue excellence across biomedical research, education, and patient care to advance health equity and wellness for people in Baltimore, the State of Maryland, and around the world. Together, we work to solve generational health challenges and make lasting contributions to the betterment of our diverse and interconnected communities.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Central Michigan University College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Central Michigan University (CMU) College of Medicine educates diverse students and trains culturally competent physicians to provide comprehensive health care and services to underserved populations in Michigan and beyond. Our faculty, staff and graduates advance health and wellness through exceptional education, innovative research, quality patient care and strategic collaborations to improve the health and wellbeing of individuals and communities. CMU College of Medicine recruits and admits students from Michigan to care for Michigan - especially those who are committed to pursue a career in primary care and serve the medically underserved.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "Michigan State University College of Human Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The College of Human Medicine at Michigan State University is committed to educating exemplary physicians and scholars, discovering and disseminating new knowledge, and providing service at home and abroad. We enhance our communities by providing outstanding primary and specialty care, promoting the dignity and inclusion of all people, and responding to the needs of the medically underserved.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Oakland University William Beaumont School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Our Mission: To develop compassionate physicians who are dedicated to improving the health of their communities, collaboration, and lifelong learning. Our Vision: To be a leader in medical education strengthened by an innovative curriculum, commitment to diversity and inclusion, dedication to community engagement, and advancing research. Our Values: Collaboration, Compassion, Diversity, Equity, and Inclusion, Excellence, and Professionalism.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Michigan Medical School",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To transform health through bold and innovative education, discovery and service. Strategic pillars for the school are focused on people, discovery, education, care and service. • People: recruit, develop and retain the best faculty, staff and learners who work together for the greater good. • Discovery: create transformative knowledge that advances science and improves health. • Education: cultivate a learning community that engages all in bold and innovative education for the advancement of science, health and health care delivery. • Care: deliver outstanding patient care and improve health for local, national and global populations while caring for each other. • Service: engage and collaborate with our institutional, local, state, national and global communities to advance health and science.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "Wayne State University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Wayne State, located in the heart of Detroit, provides a distinct experiential advantage that sets students apart from their peers and prepares them to be health care leaders and advocates. Our Highways to Excellence curriculum provides students with an organ systems-based curriculum, a focused clinical skills course, a deep and authentic understanding of health needs and challenges, multiple ways to take advantage of experiential service-learning, community engagement and research opportunities, and more. Our students have many opportunities to volunteer in the community, including at student-run free clinics, with area nonprofits, urban gardens, area schools and much more. Students also have access to a myriad of academic, financial, career and mental health support services designed to remove barriers and help them succeed as students, physicians, and health care leaders and advocates. Since 1868, the Wayne State University School of Medicine has educated and trained more than 26,000 highly-skilled and compassionate physicians, researchers and public health professionals. Our graduates are sought-after, and a large percentage serve in under-resourced communities. Our Class of 2024 achieved a 98.1 percent residency match rate, well above the national average, matching into 24 specialties in 30 states.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Western Michigan University Homer Stryker M.D. School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Mission: WMed is committed to excellence and health equity through transformative medical education, high-quality patient care, innovative research, and community partnerships within a just culture of diversity, equity, inclusion, and belonging. Vision: Health equity for all in Southwest Michigan through innovation in the practice and study of medicine. Values: Together We: Excel with integrity and professionalism Champion safety and belonging Listen, collaborate, and serve with respect and compassion",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Mayo Clinic Alix School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Mission: Develop a diverse group of servant physician leaders by providing excellence in education, fostering a culture of patient-centered care, and stimulating scientific discovery. We aim to promote health equity and improve clinical care through innovation and collaboration. Vision: Transform healthcare through excellence in education, innovation, and leadership. Core Principals: Lead, Transform and Heal Mayo Clinic Alix School of Medicine will: - Enroll an outstanding and diverse student body that has a strong foundation in the sciences and a demonstrated commitment to service and continuous learning - Attract and sustain an outstanding and diverse faculty who contribute to education scholarship and utilize the best principles of education to optimize students' professional development - Provide a learner-centered curriculum that aligns with evolving technological trends and integrates strong basic sciences, ethical principles, professional standards and outstanding clinical training - Provide an intellectually stimulating environment where small class size and a large faculty of physicians, scientists and other health professionals unite to promote the scientific and humanitarian practice of medicine In order to graduate physicians who will: - Provide service and demonstrate leadership within health care systems and within the community - Serve as leaders of change to improve the health care system and delivery - Advance the scientific foundations of medicine through leadership in basic, clinical and translational research - Promote the role of the physician as educator-mentor and the importance of lifelong learning - Foster resilience and wellness in themselves and others, demonstrating work-life integration and compassionate self-care and care of others - Make altruistic career choices based on personal skills without the burden of excessive educational debt - Have mastered the knowledge and skills required for diagnosis, patient management, health promotion, disease prevention and high-value health care - Respect the importance of the patient as an individual as well as the needs of populations, and consistently practice evidence-based medicine and shared decision-making - Work collaboratively within multidisciplinary health care teams - Contribute to a diverse and culturally competent workforce - Practice both the art and science of medicine, and incorporate the highest ethical principles into their lives and practices",
    "primary_category": "The Leader"
  },
  {
    "school_name": "University of Minnesota Medical School",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Committed to innovation and diversity, the Medical School educates physicians, scientists, and health professionals; generates knowledge and treatments; and cares for patients and communities with compassion and respect. We value excellence, inclusiveness, collaboration, and discovery. The mission of the regional campus located in Duluth is to be a national leader in improving healthcare access and outcomes in rural Minnesota and American Indian/Alaska Native (AI/AN) communities. In partnership with CentraCare, the regional campus in St. Cloud offers a wide range of patient experiences throughout students’ education in Greater Minnesota and prepares them to become exceptional clinicians and leaders for rural and immigrant populations.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Saint Louis University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Mission and Values The mission of the Saint Louis University School of Medicine is the pursuit of excellence in education, research, clinical care and community engagement through professional development, collaboration and social justice. Core Values: Cura Personalis – Care for the whole person, rooted in the Ignatian principle that God created us to do good in the world, and embracing the humanity in all Scholarship – Delivering transformative education and creating new knowledge Discovery – Research, scientific inquiry, and the application of that knowledge Equity – Striving for justice, fairness, and diversity in our education, research and service to the community Collaboration – Partnership across Saint Louis University, SSM Health and the wider community Established in 1836, the school has the distinction of awarding the first medical degree west of the Mississippi River and proud to be part of the 450-year tradition of Jesuit education. The School of Medicine trains physicians and scientists, conducts medical research, and provides health services on a local, national and international level. We strive to graduate physicians who manifest in their personal and professional lives an appreciation for humanistic medicine. Grounded in Jesuit values, we serve our community, which faces challenges of poor health indicators, education, poverty and racism and the School of Medicine continues to work for health equity and well-being of our neighbors. We embody Cura Personalis (“care for the individual person”). Our work goes beyond training physicians to be scholars of the human body. We graduate doctors who appreciate humanistic medicine, concern themselves with the sanctity of human life and commit to dignity and respect for all patients.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Missouri-Columbia School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To improve the health of all people, especially Missourians, through exemplary education, research and patient-centered care.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "University of Missouri-Kansas City School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the University of Missouri-Kansas City School of Medicine is to improve the health and well-being of individuals and populations through innovative educational programs in medicine and biomedical science, cutting-edge biomedical research, and leadership in academic medicine. The School strives to implement this mission with the highest professional and ethical standards, in a culture of diversity and inclusiveness, and in an environment that enables each individual to develop to his or her full potential.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "Washington University in St. Louis School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "WashU Medicine will lead in advancing human health through the promotion of wellness and delivery of outstanding health care, innovative research and the education of tomorrow's leaders in biomedicine within a culture that supports diversity, inclusion, critical thinking and creativity. In leading the advancement of human health, it is the mission of WashU Medicine to cultivate excellence and collegiality within an equitable and inclusive community; to attract, develop, advance and support a diverse and talented current and future workforce; to innovate through discoveries and inventions in basic, clinical, translational and population sciences; and to build and support an environment that fosters exceptionally creative research, health care, education and the well-being of our workforce. We draw on our academic excellence and scientific rigor to continually advance and enhance health care in a way that ensures access, compassion, high value, equity and evidence-based care for all people in our community, including those who are underserved and uninsured. We resolve to observe the highest standards of ethics, integrity and humanity across all of our missions, and to apply advances in research, education and health care for the betterment of the human condition, locally and globally. Educating tomorrow’s leaders in biomedicine involved reimagining a medical curriculum that fosters both self-directed and team-based learning. The Gateway Curriculum, implemented in 2020, provides exposure to research and advocacy in basic science, clinical-translational science, public and population health, primary care, and the social sciences, as well as longitudinal experiences with patients in community-based settings. Such a dynamic curriculum enables students to create new science that will enrich the health of our community, while becoming empathic practitioners who will commit to eliminating intractable and unconscionable health disparities. Our Gateway Curriculum ensures that our students are not only exceptional physicians, but that they understand the social and structural determinants of health and are prepared to lead transformational changes needed to improve our future. The Explore program within Gateway is a formalized approach to career development that helps students find their niche in academic medicine among four pathways--Advocacy/Global Health, Education, Innovation, and Research. The Office of Diversity Programs, in its 26th year, operates under a social justice framework that highlights the importance of providing culturally aware, equitable and compassionate care for all. Active, long-term community engagement is one way we execute our social justice mission. Diversity Programs works closely with the Office of Medical Education to provide counseling and support services, resources, and meaningful, longitudinal community partnerships for our medical students. Our Office of Admissions operates under a holistic framework, and the Office of Student Affairs strives to provide an inclusive learning environment. Students from minoritized groups are supported by active chapters of the Student National Medical Association, Latino Medical Student Association, Asian Pacific American Student Association, and a network of residents and faculty from diverse groups. As an example, students identifying as a gender or sexual minority have access to LGBTQmed, a student-run interest group dedicated to lesbian, gay, bisexual, transgender, and queer identity and health, as well as OUTmed, an organization for LGBTQIA-identified faculty, residents, fellows and staff. A network of faculty coaches facilitates students’ navigation through the curriculum and ensures that our students are reaching their full personal and professional potential. The Career Counseling Office works closely with students to explore the possibilities for graduate medical training and careers.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Mississippi School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of Mississippi School of Medicine is committed to training skilled and compassionate physicians to provide high-quality and equitable health care particularly to the state’s residents, including diverse and underserved populations. The school prepares learners to provide excellent care through programs of innovative education, state-of-the-art research and comprehensive clinical practice.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "Brody School of Medicine at East Carolina University",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Brody School of Medicine’s mission is to increase the supply of primary care physicians serving Eastern North Carolina and the state, to improve the health and well-being of the region, and to train physicians who will meet the health care needs of the state.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "Duke University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "DukeMed is a diverse and inclusive community of trainees devoted to understanding the causes, prevention and treatment of human disease. These endeavors are embraced by all students committed to the highest academic goals utilizing unparalleled resources in education, clinical care, and research. Our objective is to educate physicians with our innovative curricula and broad-based clinical and research training.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Methodist University Cape Fear Valley Health School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the Methodist University Cape Fear Valley Health School of Medicine is to prepare our graduates to be socially accountable, community-engaged, evidence-based, compassionate, equity-focused physician leaders who will contribute to mitigating health disparities and improving health outcomes in southeastern NC or wherever they may practice.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of North Carolina at Chapel Hill School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the UNC SOM is to improve the health and well-being of North Carolinians and others whom we serve. We will accomplish this by achieving excellence and providing leadership in the interrelated areas of patient care, education, and research. Our school’s mission informs the structure and content of our curriculum. Our curriculum reflects the ever-changing practice of medicine, meets the desire for early career differentiation and exploration, and promotes social justice as a cornerstone for equitable and safe healthcare. Our school’s mission impacts student life and support services. Our student support bench is extensive to promote learning in a respectful and diverse environment. We have an Advisory College system which provides a more accessible social and educational structure in the context of a large student body. Our Wellness Program includes group discussions surrounding stress, coping, loss, and more. One-on-one counseling, with therapists, provide services dedicated to medical students and increases access for our students. UNC SOM has a multipronged strategy to optimize the Learning Environment including enhanced reporting structures, robust incident management, bystander training, and intentional culture change. Students arrive to medical school at varying points developmentally in their professional identity formation. The Student Professionalism Committee assures that students are educated and held to the highest standards of professionalism by addressing professionalism issues with an eye towards education and support rather than disciplinary action. The Office of Academic Excellence (OAE) provides academic support for students across all training sites around the state. The OAE’s goal is to enable students from all backgrounds to be academically successful in medical school and prepared to pursue the careers of their choosing. Our school’s mission influences admissions practices and priorities. To care for and represent our state and our nation, the UNC SOM recruits students from a variety of lived experiences to create a socially responsible highly skilled workforce. We not only wish to recruit primary care doctors and individuals who wish to practice in rural communities, but also recruit individuals who will be leaders in academia, science, and industry. We believe that interaction between students with varying clinical, research, and education interests enhances the experience of students at the UNC SOM. Particular programs that help us achieve our goals are described below. The Community Health Track is a partnership that has grown from the pre-existing accelerated FIRST Program and the Kenan Rural Scholars Program. Leadership from FIRST and Kenan recognized the opportunity for collaboration and the creation of a dedicated track experience for students with shared interests, including rural and underserved care, commitment to the state of North Carolina, and the desire to work within Primary Care. The UNC MD-PhD Program prepares high-achieving students to be leaders in academic medicine and scientific health discovery. The primary goal of the MD-PhD Program is to train physician-scientists, fully capable of bridging the gap between science and clinical medicine. The Medical Educational Development program (MED) is a summer pipeline program for aspiring medical and dental students. Our school’s mission is reflected in the professional activities of our graduates. After graduation, our students train in competitive residency programs at top institutions across our state and country ( https://www.med.unc.edu/ome/studentaffairs/residency-and-the-match/residency-placements/ ). Beyond residency, we are proud to see our graduates joining the faculty of top academic centers, as well as successfully practicing clinical medicine.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "Wake Forest University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the Wake Forest University School of Medicine (WFUSM) is to educate future physicians who are empowered to transform health for all. Our vision is to be national leaders in medical education and innovation, graduating purpose-driven physicians committed to improving the health of individuals and communities through lifelong learning.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "University of North Dakota School of Medicine and Health Sciences",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The primary purpose of the University of North Dakota School of Medicine & Health Sciences is to educate physicians and other health professionals and to enhance the quality of life in North Dakota. Other purposes include the discovery of knowledge that benefits the people of this state and enhances the quality of their lives.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "Creighton University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Creighton University School of Medicine’s mission focuses on the values of service, integrity, and excellence in medical education, all grounded in Jesuit traditions. This mission guides various aspects of the school, from recruitment and admissions to curriculum design and student life, ultimately shaping the professional identity of graduates. Creighton’s mission emphasizes the development of compassionate, ethical, and service-oriented physicians. As such, the admissions process is designed to prioritize candidates who demonstrate a commitment to service, social responsibility, and alignment with the school’s Jesuit values. The school values diversity and seeks applicants who are not only academically accomplished but also possess the qualities of empathy, integrity, and a passion for helping others. This results in a holistic admissions process that evaluates academic performance, life experiences, leadership, and an applicant’s desire to engage in the community and serve the underserved. This approach attracts students who are aligned with the mission of serving others, particularly in under-resourced communities. The curriculum at Creighton University School of Medicine is rooted in the Jesuit values of cura personalis (care for the whole person), service to others, and ethical practice. The content and structure of the curriculum reflect a balance between the scientific and humanistic aspects of medicine. The school incorporates service learning, community outreach, and clinical experiences that emphasize empathy, cultural competence, and patient-centered care. Students engage in hands-on opportunities to serve in local and global health initiatives, with the goal of cultivating physicians who are not only skilled but also compassionate and socially conscious. Additionally, the curriculum encourages critical thinking and ethical decision-making, fostering future leaders who will advocate for healthcare improvements and social justice. Graduates of Creighton University School of Medicine carry forward the mission of the institution in their professional lives, contributing to healthcare in ways that are grounded in ethical practice, compassionate care, and a commitment to underserved populations. Many Creighton graduates pursue careers in primary care, family medicine, and specialties that serve disadvantaged communities. They are trained to approach their patients as whole individuals, with respect for their unique experiences, cultural backgrounds, and needs. Many also take on leadership roles in healthcare systems, advocacy, and public health, working to improve access to care and reduce health disparities. The values instilled at Creighton also lead graduates to serve in international settings, offering their skills and knowledge to underserved populations around the world. Overall, the mission of Creighton’s School of Medicine fosters graduates who are not only skilled clinicians but also compassionate and socially responsible leaders in healthcare.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Nebraska College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of the College of Medicine at the University of Nebraska Medical Center is to improve the health of citizens of Nebraska by advancing health and biomedical sciences through the highest quality education, exemplary patient care and research excellence.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "Geisel School of Medicine at Dartmouth",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Our Mission: -To improve the lives of the communities we serve through inclusive excellence in learning, discovery, and healing. -To foster an inclusive, diverse community that reflects our world and addresses the most challenging issues in healthcare. At Geisel, our Vision is to be the medical school that sets the standard for educating humanistic physicians, scientists, and educators to be leaders of change and to flourish in their chosen paths . We strive to build a diverse and inclusive community reflective of our world in order to enrich learning, foster innovation, and help tackle the most vexing challenges in health care. We aim to do this by cultivating character, a growth mindset and servant leadership qualities in our students so that they may best serve our communities locally and globally to live healthier and fulfilled lives.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "Cooper Medical School of Rowan University",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Cooper Medical School of Rowan University is committed to providing humanistic education in the art and science of medicine within a scientific and scholarly community in which excellence in patient care, innovative teaching, scholarly activity and service to our community are valued. Our core values include a commitment to: a positive learning environment, mentorship, professionalism, patient advocacy, wellness, the communities we serve, and scholarly activity. Our Vision: Cooper Medical School of Rowan University will distinguish itself as an innovator in medical education and biomedical research that will lead to the transformation of healthcare.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "Hackensack Meridian School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To develop our students, residents, fellows, faculty, and healthcare environment to deliver the highest quality care for all. Embrace and model our professional reverence for the human condition, empathy towards suffering, excellence in medical care, research and discovery, and humility in service; Continue to serve and learn from the engagement of underrepresented minority populations among student, faculty, staff, and community; Integrate lifelong learning and inquiry into their practice; Work in communion with scholars and practitioners of other disciplines to integrate their perspectives, experiences, and tools; and Understand that context, community, and behavior, drive well-being.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Rutgers New Jersey Medical School",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Mission: The mission of New Jersey Medical School is to educate students, physicians, and scientists to meet society’s current and future healthcare needs through patient-centered education; pioneering research; innovative clinical, rehabilitative and preventive care; and collaborative community outreach. Vision: To create, transmit and utilize knowledge to shape the future of medicine and to enhance the quality of life for the people of New Jersey. Values: -Personal respect for patients, students, staff, faculty and community -Passionate commitment to excellence in service, research and training -Celebration of diversity in culture, ethnicity, religion, gender and individual goals -Professionalism in all conduct -Commitment to serving needs of constituents -Progress through partnerships",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "Rutgers, Robert Wood Johnson Medical School",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "School Mission: Robert Wood Johnson Medical School is dedicated to transforming health care for New Jersey and the nation through innovation and excellence in education, discovery, patient and family-centered care and addressing the health of our diverse community. School Vision: Robert Wood Johnson Medical School will become the academic engine driving a new healthcare paradigm in New Jersey; the state's first and largest academic high-value health care system. School Core Values: Respect, dignity, and humanism for the diverse community we serve and the diverse community we are; Wellness and resilience; Joining learners hand-in-hand with care delivery; Making patients first with safe, compassionate, high-quality care; Science to advance human health. Education Mission: The medical education program aspires to be a nationally recognized program. It is a patient-centered program that prepares medical learners to become resilient and adaptable physicians who provide high value, ethical and appropriate healthcare in an ever changing system; communicate respectfully and effectively in a patient and family centered fashion; collaborate with other health care professionals to devise treatment plans and strategies for adherence and self-care, tailored to the needs and preferences of the patient; integrate the scientific underpinnings of clinical medicine and best evidence into daily practice; and who distinguish themselves as medical professionals in discovery, service and leadership. The longitudinal Patient Centered Medicine-Health Equity course and curricular threads in evidence based medicine, health equity and health systems science support the educational mission. RWJMS is committed to fostering a diverse learning community of students, faculty and staff from a broad spectrum of nations, cultures, and historical perspectives. Our collective goal is to create an institutional consciousness of diversity reinforced with equity and excellence through inclusion, non-discrimination, and pluralism for all members of the University Community. Individuals with disabilities are important members of a diverse culture on our campuses and RWJMS is committed to complying with the requirements of the Americans with Disabilities Act (ADA). Robert Wood Johnson Medical School seeks to broaden representation among the student body. Our school aims to prepare our students to become competent, compassionate, culturally aware and sensitive physicians in our increasingly diverse society. A key aspect of our mission is having graduates who can provide care “tailored to the needs and preferences of the patient,” and therefore, we recruit and admit students whose experiences and backgrounds can enrich the learning environment and who share a wide range of perspectives. The health equity thread ensures our students understand and can serve the community in which they practice. A comprehensive communication curriculum ensures that students learn to communicate with empathy and clarity. Student support services have been enhanced with a THRIVE program that provides our students with the tools they can use to promote their own wellness and better support their patients. Our graduates engage in a wide range of enrichment activities and distinguish themselves in areas such as research, medical education, leadership, entrepreneurship, global health, humanities, and service to the community, to name a few. They are prepared to practice in a variety of healthcare environments, from the academic medical center to local community hospitals, office practices, federally qualified health centers, and the home. They fulfill the school’s missions by pursuing a wide range of specialties, including primary care.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "University of New Mexico School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Our mission is to advance the health of all New Mexicans by educating and increasing the diversity of health professionals, leaders and scientists, providing outstanding and compassionate medical care, advocating for the health of all New Mexicans, and pursuing new knowledge and excellence of practice. Mission Impact in Admissions • We observe mission-aligned selection practices when assessing applicants. Once minimum requirements have been met, we blind interviewers to the MCAT, GPA and academic record of applicants. This allows us to select applicants who align with our mission and who are committed to improving healthcare in our local communities. • We recognize the importance of rural and community physicians in addressing health equity issues. By involving them in our admissions committee they provide valuable perspectives to the selection process and contribute to a more diverse medical community. • In an effort to support applicants from rural and underserved communities or low socioeconomic backgrounds, we provide post application workshops, and individual consultations with specific recommendations to help individuals improve their future applications. Mission Impact in Medical School Curriculum • We provide students with the opportunity to engage in faculty-mentored scholarly projects related to health care issues in local communities. The focus on the Rural and Urban Underserved Program (RUUP) adds a significant dimension by allowing students to work directly with medically underserved communities. • The Practical Immersion Experience is a 6-week rural community-based clinical preceptorship, where students live in the assigned community. This provides a unique and immersive learning opportunity with first-hand experience to observe and understand daily",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Kirk Kerkorian School of Medicine at UNLV",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Kirk Kerkorian School of Medicine at UNLV aims to improve access to high-quality health care in Nevada by increasing the number of physicians and trained specialists committed to serving the region, particularly diverse and medically underserved populations. It also generates top-quality research spanning basic and clinical sciences.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Roseman University College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Roseman University College of Medicine aims to produce a future healthcare workforce of clinically excellent, community-based, socially accountable, humble, compassionate, and inclusive physicians. It seeks to decrease health disparities in Nevada through innovative teaching that emphasizes clinical excellence, ethics, humility, empathy, critical thinking, and real-world experience, ensuring graduates understand the Social Determinants of Health and partner with communities.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Nevada, Reno School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of Nevada, Reno School of Medicine aims to improve the health and well-being of all Nevadans and their communities through a commitment to diversity, inclusion, excellence in education, research, and clinical care, with a vision of diverse professionals improving health in both rural and urban communities.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Albany Medical College",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Albany Medical College is committed to improving health through high-quality care delivery, education, and research. It aims to provide the best patient experience, foster teaching, learning, and discovery, and promote the value and strength of people from all communities.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "Albert Einstein College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Albert Einstein College of Medicine is a research-intensive medical school dedicated to preparing students to become knowledgeable, compassionate physicians and innovative scientific investigators, and to create new knowledge, while also providing patient-centered clinical care and enhancing human health in communities.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Columbia University Vagelos College of Physicians and Surgeons",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Columbia University Vagelos College of Physicians and Surgeons aspires to transform human health by driving discovery, advancing care, and educating leaders. It aims to educate the next generation of physician leaders to serve communities with a lens of justice, promote health, provide state-of-the-art and equitable patient care, engage in medical research, and contribute to healthcare policy, fostering a culture of inclusion and serving underserved populations.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "CUNY School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "CUNY School of Medicine's mission is to produce broadly-educated, highly-skilled medical practitioners committed to providing quality health services in communities historically underserved by primary care providers. It aims to expand access to medical education for individuals from socioeconomically disadvantaged backgrounds and historically underrepresented communities.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Donald and Barbara Zucker School of Medicine at Hofstra/Northwell",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Donald and Barbara Zucker School of Medicine at Hofstra/Northwell is dedicated to inspiring diverse and promising students to lead and transform medicine for the betterment of humanity, aiming to be a premier 'Millennial Medical School' and a major contributor to redefining medical education, ultimately improving the health of the region.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "Icahn School of Medicine at Mount Sinai",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Icahn School of Medicine at Mount Sinai advances science, medicine, and health care delivery for the benefit of humanity through a culture of excellence, innovation, collaboration, and inclusive diversity. It conducts groundbreaking research, educates future clinicians, researchers, teachers, and leaders, and delivers advanced compassionate care with a commitment to health equity.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Jacobs School of Medicine and Biomedical Sciences at the University at Buffalo",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Jacobs School of Medicine and Biomedical Sciences at the University at Buffalo strives to advance health and wellness for people globally by educating future leaders in medicine and biomedical sciences capable of conducting innovative research and delivering outstanding clinical care.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "New York Medical College",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "New York Medical College educates physicians, scientists, public health specialists, and other healthcare professionals, conducts biomedical and population-based research, and provides service to its community. It emphasizes diversity and inclusion to educate outstanding healthcare professionals for the multicultural world of the 21st century.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "NYU Grossman Long Island School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "NYU Grossman Long Island School of Medicine aims to develop preeminent physician leaders through scholarship and innovative medical education anchored in primary care and health systems science. Its specific mission is to address the physician workforce shortage in primary care, empowering graduates to lead in high-quality, value-based, equitable, patient-focused, family-centered, and community-based healthcare, notably through a pioneering three-year accelerated program with directed residency pathways in primary care fields.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "NYU Grossman School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "NYU Grossman School of Medicine aims to recruit academically talented and interpersonally gifted students to deliver excellence in clinical care, research, and medical education to all members of society. It seeks to identify applicants poised to become tomorrow’s physician leaders, committed to meeting the needs of patients, community, and the medical profession.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "Renaissance School of Medicine at Stony Brook University",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Renaissance School of Medicine at Stony Brook University is committed to recruiting and training diverse students, clinicians, and physician-scientists in biomedical sciences to improve the health of all individuals and populations through education, outreach, compassionate care, and research that discovers the biology of disease and informs novel preventive, diagnostic, and therapeutic strategies.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "State University of New York Upstate Medical University Alan and Marlene Norton College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The primary mission of SUNY Upstate Medical University Alan and Marlene Norton College of Medicine is the education of health professionals and biomedical research. Its clinical faculty and healthcare professionals are committed to education and patient care, demonstrating excellence and compassion, while fostering an environment of mutual trust and respect.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "SUNY Downstate Health Sciences University College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "SUNY Downstate Health Sciences University College of Medicine aims to provide outstanding education to future physicians, scientists, nurses, and other healthcare professionals, advance knowledge through cutting-edge research, care for and improve the lives of globally diverse communities, and foster an environment that embraces cultural diversity.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "University of Rochester School of Medicine and Dentistry",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of Rochester School of Medicine and Dentistry improves health through an innovative medical education program emphasizing humility and growth. It inspires learners to become compassionate leaders in medicine and science by emphasizing collaboration, discovery, and excellence, developing doctors who see the entire person through its revolutionary biopsychosocial model.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "Weill Cornell Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Weill Cornell Medicine is committed to excellence in research, teaching, patient care, and the advancement of the art and science of medicine. Its mission is to provide the finest education, conduct research at the leading edge of knowledge, improve healthcare for the nation and world, and deliver the highest level of clinical care for its communities.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Case Western Reserve University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Case Western Reserve University School of Medicine aims to improve global health by linking research to populations in a superb educational environment. It educates future physicians to provide compassionate patient care, fosters leadership, scholarship, and research, and is dedicated to discoveries in translational science and improving community health, with a holistic approach that considers applicants from underserved and marginalized backgrounds.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Northeast Ohio Medical University",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Northeast Ohio Medical University College of Medicine inspires medical students to become exemplary patient care-centered physicians through education, research, and public service. It seeks to improve the health and quality of life of communities in Ohio and beyond, including diverse and underserved populations.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "Ohio State University College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Ohio State University College of Medicine recruits self-directed learners to become empathetic physicians providing evidence-based, compassionate medical care. It seeks a diverse class with strong intellect and potential to improve lives through innovation in research, education, patient care, and community service.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "The University of Toledo College of Medicine and Life Sciences",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of Toledo College of Medicine and Life Sciences aims to improve health in its communities and region by educating excellent clinicians and scientists, providing patient-centered and high-quality care, and producing nationally recognized research in focused areas.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "University of Cincinnati College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of Cincinnati College of Medicine educates and trains future physicians, scientists, and health professionals, advances knowledge through impactful, innovative research, and improves health and well-being through compassionate, patient-centered care, all in a spirit of collaboration, inclusion, and service.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Wright State University Boonshoft School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Wright State University Boonshoft School of Medicine transforms lives through outstanding education, innovative research, community partnerships, and exemplary clinical care. It amplifies diversity and belonging while advancing health in Ohio’s communities and beyond.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Oklahoma College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of Oklahoma College of Medicine provides an excellent educational experience through teaching, research, creative activity, and service to the state and society. It aims to be a regional leader in education, research, and patient care, emphasizing compassionate patient care, teamwork, and continual improvement.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "Oregon Health & Science University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Oregon Health & Science University School of Medicine enhances human health through excellence in education, research, healthcare, and public service, particularly to underserved populations. It fosters compassion, humanism, professionalism, and cultural competence in patient care, enabling students to meet the health-related needs of the multiple communities they will serve.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Drexel University College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Drexel University College of Medicine delivers innovative biomedical education embracing inquiry and collaboration, founded on excellence in patient care, and a culture of respect for diversity. It is committed to meeting the healthcare needs of the communities it serves.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Geisinger Commonwealth School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Geisinger Commonwealth School of Medicine educates aspiring physicians and scientists to serve society using a community-based, patient-centered, interprofessional, and evidence-based model of education committed to inclusion, promoting discovery, and utilizing innovative techniques.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Lewis Katz School of Medicine at Temple University",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Lewis Katz School of Medicine at Temple University aligns with diverse communities to advance medicine and improve health through education, research, training, and development of future clinicians, educators, and scientists. It aims to inspire a new standard of excellence and lead social change in medicine, valuing diversity and health equity.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Pennsylvania State University College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Pennsylvania State University College of Medicine is committed to enhancing quality of life through improved health, preparing professionals to serve health needs, and discovering knowledge. It educates medical students and researchers, enrolling diverse students with an innovative education, preparing graduates to practice in diverse communities and specialties.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Perelman School of Medicine at the University of Pennsylvania",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Perelman School of Medicine at the University of Pennsylvania advances knowledge and improves health through research, patient care, and education in a community fostering innovation, critical thinking, equal opportunity, and lifelong learning, sustaining its legacy of excellence.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Sidney Kimmel Medical College at Thomas Jefferson University",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Sidney Kimmel Medical College at Thomas Jefferson University educates physicians to lead integrated healthcare delivery and research teams, discovers new knowledge through investigation from laboratory to community, and sets standards for quality, compassionate patient care. It recognizes a diverse community as imperative for excellence in patient care, education, and research, aspiring to be a community of discovery, learning, and inclusion.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "University of Pittsburgh School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of Pittsburgh School of Medicine improves the health and well-being of individuals, communities, and populations through cutting-edge research, innovative educational programs in medicine and biomedical science, and leadership in academic medicine, fostering an environment for all to develop to their fullest potential.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "Ponce Health Sciences University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Ponce Health Sciences University School of Medicine educates bilingual, ethical professionals to provide compassionate, culturally competent healthcare and generate high-impact research to reduce health disparities in the populations served in Puerto Rico and the US, through high-quality education in a diverse environment.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "San Juan Bautista School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "San Juan Bautista School of Medicine educates a diverse generation of physicians and health professionals to deliver high-quality care and conduct clinical research. Its special interest is centered on community health, translational community medicine research, and graduating physicians responsive to the health needs of underserved and medically vulnerable populations.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Universidad Central del Caribe School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Universidad Central del Caribe School of Medicine forms competent, diverse health professionals with excellent academic preparation within a humanistic and holistic framework. It ensures graduates possess professionalism and commitment to social duties and service to Puerto Rico and Hispanic communities in the mainland.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Puerto Rico School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of Puerto Rico School of Medicine provides quality education for diverse and competent biomedical sciences researchers and physicians to deliver excellent, empathetic, and humanistic health services at the forefront of technology. It generates new knowledge through biomedical, clinical, translational, and community research to solve local and global health problems, and provides quality inter-professional healthcare services while contributing to public policy formulation.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "The Warren Alpert Medical School of Brown University",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Warren Alpert Medical School of Brown University supports and promotes the health of individuals and communities through innovative medical education programs, research initiatives, and clinical excellence in service to society, aiming to improve the health and wellness of all.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "Medical University of South Carolina College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Medical University of South Carolina College of Medicine develops outstanding physicians to deliver high-quality, compassionate patient care. Its students are equipped to be exemplary interprofessional team members addressing complex needs of diverse populations. Educators and leaders are committed to scientific discovery, teaching, learning, diversity, and inclusion.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "University of South Carolina School of Medicine Columbia",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of South Carolina School of Medicine Columbia serves the people of South Carolina and beyond through exemplary health and medical education, transformative research, and compassionate care for all. Its core mission is to serve South Carolina, providing compassionate care for all, exposing students to underserved communities through volunteering, and encouraging positive community impact.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of South Carolina School of Medicine Greenville",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of South Carolina School of Medicine Greenville empowers the next generation of physicians through cutting-edge technology, interprofessional collaboration, innovative teaching, and transformational research. It strives to educate compassionate future physician leaders to deliver the highest quality patient care, enhancing the health and wellness of the communities it serves.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "University of South Dakota, Sanford School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of South Dakota Sanford School of Medicine provides South Dakota residents with a quality medical education emphasizing family medicine, encouraging graduates to serve medically underserved areas. It offers excellence in education, research, and service to the people of South Dakota, providing pathways for MD and PhD degrees, and serving as a technical resource for health care policy and initiatives to improve citizen health.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "East Tennessee State University James H. Quillen College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The primary mission of the East Tennessee State University James H. Quillen College of Medicine is to educate and train future physicians, particularly those interested in primary care, to serve in underserved rural communities. It advances biomedical research and improves healthcare in Northeast Tennessee and the Appalachian region, emphasizing primary care and prioritizing candidates with an interest in rural and primary care, with over 50% of graduates pursuing primary care residencies in rural and underserved areas.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "Meharry Medical College",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Meharry Medical College is a global academic health sciences center advancing health equity through innovative research, transformative education, exceptional and compassionate health services, and policy-influencing thought leadership. It empowers diverse populations to improve the well-being of humankind, dedicated to the development of a diverse group of students, faculty, residents, and staff committed to the study and practice of medicine, upholding values of equity with inclusion and service with compassion.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Thomas F. Frist, Jr. College of Medicine at Belmont University",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Thomas F. Frist, Jr. College of Medicine at Belmont University cultivates diverse physician leaders of character who embrace a whole-person approach to healing in a community of service-learning, inspired by character and the love and grace of Christ, aiming to shape medicine through transformative whole person care.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "University of Tennessee Health Science Center College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of Tennessee Health Science Center College of Medicine transforms lives through collaborative and inclusive education, research/scholarship, clinical care, and public service. It aims to improve the health of Tennesseans and society by providing an exceptional environment for education, contributing to advances in medical science, and delivering high-quality health services.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Vanderbilt University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Vanderbilt University School of Medicine's mission is to catalyze the advancement of impactful discovery, servant leadership, and lifelong learning. It nurtures clinicians, scientists, and educators to serve and lead communities, creates and disseminates new knowledge, provides compassionate, high-quality patient care, strives for health equity, embraces innovation, and builds a diverse community.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Anne Burnett Marion School of Medicine at TCU",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Anne Burnett Marion School of Medicine at TCU's mission is to transform health care by inspiring Empathetic Scholars™. It aims to be a leader in medical education, delivery of care, and scholarship, focusing on character, content, context, creativity, collaboration, community, and communication.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "Baylor College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Baylor College of Medicine is a health sciences university that creates knowledge and applies science and discoveries to further education, healthcare, and community service locally and globally. Its School of Medicine develops diverse, compassionate physician leaders and educators who provide expert patient-centered care to diverse populations, supported by evidence-based practice and scientific innovation.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "McGovern Medical School at the University of Texas Health Science Center at Houston",
    "degree_type": "MD",
    "application_system": "TMDSAS",
    "mission_statement": "McGovern Medical School at the University of Texas Health Science Center at Houston educates a diverse body of future physicians and biomedical scientists, provides outstanding patient-centered care, and conducts innovative research that benefits the health and well-being of the population of Texas and beyond.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Texas A&M University School of Medicine",
    "degree_type": "MD",
    "application_system": "TMDSAS",
    "mission_statement": "Texas A&M University School of Medicine's mission is to improve the health and well-being of the people of Texas through excellence in education, research, and healthcare delivery, specifically serving underserved populations. It aims to develop innovators and leaders who will transform American medicine, with a key focus on Rural Population Health.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Texas A&M School of Medicine",
    "degree_type": "MD",
    "application_system": "TMDSAS",
    "mission_statement": "Through our keen focus on rural populations and innovative care delivery, the college eliminates health disparities throughout Texas. The School of Medicine honors Texas A&M University’s rich military legacy. Through our unique relationship with the TAMU Corps of Cadets, military academies and veteran populations, the college improves the lives of military members and their families. The School of Medicine makes the impossible, possible - by creating systems and technologies that address health care’s greatest challenges and bringing together the brightest minds in health care and engineering. MEDICAL EDUCATION is the thread that creates a singular vision for future and current students, researchers, alumni and practicing physicians. By impacting education and training at all levels, the School of Medicine fosters achievement of career goals and the transformation of health care for patient populations. Our curriculum brings flexibility and individualization to the education process, to create lifelong-learners and bring better health care to all. The School of Medicine implements an updated and fully integrated curriculum providing students with a pre-clerkship curriculum of 18 months. Students embark on their pre-clerkship training at the Bryan-College Station campus for 12 months and then transition to their campus designations for the remaining 3 years of training. Students have several options for study across our campuses – each has a distinct environment and offerings for education and lifestyle. The school provides clinical training through affiliated medical facilities in Bryan-College Station, Corpus Christi, Dallas, Fort Hood, Houston, San Antonio and Temple. The school is committed to providing an environment that promotes the Aggie Core Values, inclusiveness and compassion in its future physicians and scientists. Our emphasis on highly integrated materials, organ systems-based instruction and institutionalized programs for support between class years is proving to produce physicians with the knowledge, expertise and vision to meet the challenges facing today's.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "Texas Tech University Health Sciences Center Paul L. Foster School of Medicine",
    "degree_type": "MD",
    "application_system": "TMDSAS",
    "mission_statement": "The mission of the Paul L. Foster School of Medicine is to provide exceptional educational and development opportunities for our diverse learning community, advance knowledge through research and innovation, and serve the needs of our border region and beyond.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Texas Tech University Health Sciences Center School of Medicine",
    "degree_type": "MD",
    "application_system": "TMDSAS",
    "mission_statement": "To enhance the overall health and outcomes for communities in which we serve, we seek to recruit students, faculty and senior administrative staff and admit individuals who have ties to West Texas or who come from or have an interest in serving rural areas, including those who may come from socioeconomically disadvantaged or first generation backgrounds. The core foundational value of including the different cultures, lifestyles, personal beliefs and ideas of all those we serve ─ and serve alongside ─ provides a positive impact on the health of our regional, national and global societies. We achieve this by producing physicians with core values who are competent and capable of making positive impacts on the health of an ever changing demographic and the communities in which they serve. As we pursue excellence in health care education, research and patient care, we will be ever mindful of the unity that is gained through our collective strengths.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "The University of Texas at Tyler School of Medicine",
    "degree_type": "MD",
    "application_system": "TMDSAS",
    "mission_statement": "The School of Medicine’s mission is fourfold: Community Engagement: Embed the School of Medicine within East Texas, focusing on communication, responsiveness, and community. The School of Medicine is East Texas, and everything we do will be in partnership with our communities. Education: Recruit, support and develop a representative healthcare and research workforce from East Texas, focused on reducing health disparities in East Texas. Research: Develop an array of biomedical, clinical, translational and population-based research programs focused on understanding and eliminating health disparities in East Texas. Clinical: Expand access to top-quality healthcare in the local communities of East Texas by developing and implementing innovative healthcare systems and leveraging existing infrastructure and programs.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "The University of Texas Health Science Center at San Antonio Joe R. and Teresa Lozano Long School of Medicine",
    "degree_type": "MD",
    "application_system": "TMDSAS",
    "mission_statement": "The mission of the School of Medicine is to serve the needs of the citizens of Texas by providing medical education and training to medical students and physicians at all career levels and fostering an environment of life-long learning that is flexible and emphasizes professionalism, with special commitment to the preparation of physicians in both the art and science of medical practice; conducting biomedical and other health-related research, with particular attention to translational research; delivering exemplary health care; and providing a responsive resource in health-related affairs for the nation and the state, with particular emphasis on South Texas.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "University of Houston Tilman J. Fertitta Family College of Medicine",
    "degree_type": "MD",
    "application_system": "TMDSAS",
    "mission_statement": "The Tilman J. Fertitta Family College of Medicine is accountable to society for improving the overall health and healthcare of the population of Greater Houston, Texas and beyond by: · Educating physicians who will provide compassionate, high-value care to patients, families, and communities with a focus on primary care and other needed physician specialties. · Conducting interdisciplinary research to find innovative solutions to problems in health and healthcare. · Providing integrated, evidence-based, high-value care delivered to patients by interprofessional teams. · Engaging, collaborating with, and empowering under-served patient populations and community partners to improve their health and healthcare",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Texas at Austin Dell Medical School",
    "degree_type": "MD",
    "application_system": "TMDSAS",
    "mission_statement": "Our Vision Working together with our community — and powered by cutting-edge technology and digital capabilities — we set the standard for excellence in integrated, multidisciplinary patient care, pioneer research with meaningful impact, lead innovation in medical education and catalyze life sciences entrepreneurship. Our vision is defining the future of health — because we know that what starts here changes the world. Our Mission To revolutionize how people get and stay healthy: -Building a sustainable academic health system that delivers person-centered, integrated care across the continuum. -Embracing novel, collaborative solutions to ensure that everyone has the opportunity to be as healthy as possible. -Empowering patients, families and communities to be active participants in the health care process through information, access, engagement and agency. -Cultivating transformative research, entrepreneurship and innovation that leads to real-world impact. -Equipping faculty, staff and learners with the knowledge and skills necessary to lead the next generation of health care. -Leading the advancement and use of cutting-edge technologies, data and digital capabilities that serve the needs of patients, physicians, health care professionals, faculty, staff, learners and our community.",
    "primary_category": "The Innovator"
  },
  {
    "school_name": "University of Texas Medical Branch John Sealy School of Medicine",
    "degree_type": "MD",
    "application_system": "TMDSAS",
    "mission_statement": "John Sealy School of Medicine at UTMB will strive to create tomorrow's medicine today by discovery and application of new knowledge, and by inspiring lifelong learning and clinical excellence. We will accomplish this mission through innovative leadership and a steadfast commitment to scholarship and service excellence by: 1) Educating and inspiring skilled physicians and scientists who are dedicated to lifelong learning and reflect the diversity of the people whom we serve. 2) Enhancing the well-being of our global community by expanding the frontiers of our basic and applied scientific knowledge and its translation from the bench to the bedside. 3) Improving the health of all individuals by providing outstanding evidence-based, compassionate, culturally fluent patient care, which recognizes the utmost importance of human interest, values, and dignity. 4) Sharing our talents to form partnerships with others — individuals, communities, governments, foundations, schools/universities and industries — in the service of our community, our state and the world",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "University of Texas Rio Grande Valley School of Medicine",
    "degree_type": "MD",
    "application_system": "TMDSAS",
    "mission_statement": "We will transform the health of the Rio Grande Valley and beyond by providing advanced academic medicine through these five pillars: * Innovative Education * Life-Changing Research and Discoveries * High Quality Patient-Centered Care * Serving our Community * Sustainability and a Culture of Entrepreneurship",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Texas Southwestern Medical School",
    "degree_type": "MD",
    "application_system": "TMDSAS",
    "mission_statement": "The mission of UT Southwestern Medical School is: Promoting health and a healthy society that enables individuals to achieve their full potential We: EDUCATE Physicians, scientists, and caregivers optimally prepared to serve the needs of patients and society DISCOVER Research that solves for unmet needs by finding better treatments, cures, and prevention with a commitment to ensuring real world application HEAL Best care possible today, with continuous improvement and innovation for better care tomorrow",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Spencer Fox Eccles School of Medicine at the University of Utah",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Spencer Fox Eccles School of Medicine at the University of Utah serves all people and communities of Utah and the Mountain West by intentionally working to improve individual and community health outcomes and quality of life. This is achieved through excellence in patient care, education, and research by: -Purposefully educating physicians, scientists, and health care professionals to ensure compassionate, patient-centered care to all. -Serving rural and underserved communities by addressing social determinants of health to decrease health disparities among all people. -Engaging in scholarly research to advance knowledge, innovation, well-being, and health for all people. -Fostering a culture of respect and community by recognizing outstanding contributions by students, trainees, staff, faculty, and community partners.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Eastern Virginia Medical School",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Macon & Joan Brock Virginia Health Sciences At Old Dominion University is an academic health center dedicated to achieving excellence in medical and health professions education, research and patient care. We value creating and fostering a diverse and cohesive faculty, professional staff and student body as the surest way to achieve our mission. Adhering to the highest ethical standards, we will strive to improve the health of our community and to be recognized as a national center of intellectual and clinical strength in medicine and Health Professions. Our commitment to ensuring institutional effectiveness is demonstrated by the continuous assessment processes we use to improve program performance and student learning outcomes.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "University of Virginia School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "At the University of Virginia School of Medicine, our mission is to transform health and inspire hope for all Virginians and beyond. Our vision is to be the nation’s leading public academic School of Medicine and the best place to work - while transforming patient care, research, education and management with the diverse communities we serve.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "Virginia Commonwealth University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Our mission is to improve health through exceptional and innovative discovery, training and patient care. With the help of our strategic plan, we will achieve our vision of being known for the accomplishments of our trainees, faculty, staff and alumni in research, education and patient care.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Virginia Tech Carilion School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "VTC's mission is to develop physician thought leaders through inquiry, research and discovery, using an innovative curriculum based on adult learning methods in a patient-centered context. Our graduates will be physicians with outstanding clinical skills and significantly enhanced research capabilities who will remain life-long learners. The VTC physician will have an understanding of the importance of interprofessionalism to enable them to thrive in a modern healthcare team.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "Robert Larner, M.D., College of Medicine at the University of Vermont",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "We celebrate over 200 years of excellence in educating physicians and physician-scientists and serving our local and global community. The mission of the Larner College of Medicine at The University of Vermont is to educate a diverse group of dedicated physicians and biomedical scientists to serve across all the disciplines of medicine; to bring hope to patients by advancing medical knowledge through research; to integrate education and research to advance the quality and accessibility of patient care; and to engage with our communities to benefit Vermont and the world. We achieve this mission through: Admissions: Mission aligned Holistic Review: Our applicant screening, interview, and acceptance processes are guided by our mission. Each matriculating student exhibits excellence in one or more of the specific tenets of our mission, be it research, experience with rural and disadvantaged communities, or significant commitment to the betterment of humanity. At the core of our university is a strong mission for social justice, which appears in our medical school mission. Because we value the unique benefits of social learning, our interview day includes a team-based activity to familiarize our candidates with this teaching approach. Student Affairs: Individualized- Timely- Compassionate A strong, interdisciplinary, and robust team of student support professionals that \"hold\" our students from the first day of Orientation until the day they are hooded and earn their MD. The team includes Personal Health & Well-being, Academic Support, & Intensive Career Planning that spans both of our campuses. Curriculum : Innovative- Learner Centered- Engaging- Relevant Our active learning approach to instruction is built on adult learning principles and proven educational pedagogy. Our students construct knowledge through a variety of teaching modalities. Larner provides rural and urban clinical opportunities on two campuses in Vermont and Connecticut, where our learners engage with diverse patient populations. Our two-campus model also allows students to select an academic (VT) or community (CT) setting for their clinical rotations. Each student is required to complete a community-focused public health project in their first year that positions them to learn how to be present in a community and because this is their passion. Check out our website for additional curricular opportunities! The secret behind why we achieve our mission is our well defined culture of professionalism. Each student who is admitted to Larner can expect to enter a community that is committed to a culture of professionalism: Our Larner College of Medicine community upholds the highest standards of professionalism as we follow our passion for lifelong learning and improvement. We demonstrate professionalism through integrity, accountability, compassion, altruism, and social responsibility. We honor the trust our society has placed in us as stewards of the art and science of medicine, relying on cultural humility, kindness, and respect to guide our daily interactions. We expect all members of our community to embrace these principles of professionalism as we strive to conduct and support patient care, research, and education that are second to none.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Washington School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The UWSOM is dedicated to improving the general health and well-being of the public. As the pre-eminent academic medical center in our region and as a national leader in biomedical research, we place special emphasis on educating and training physicians, scientists, and allied health professionals dedicated to two distinct missions: - Meeting the health care needs of our region, especially by recognizing the importance of primary care and providing service to underserved populations; - Advancing knowledge and assuming leadership in the biomedical sciences and in academic medicine. The School has a special responsibility to the people in the states of WA, WY, AK, MT, and ID. We are committed to building and sustaining a diverse academic community and to assuring that access to education and training is open to learners from all segments of society, acknowledging a responsibility to the diverse populations within our region. http://www.uwmedicine.org/education/about/mission",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Washington State University Elson S. Floyd College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To serve Washington and beyond through collaboration and problem-solving in education, research, and health care with a focus on rural communities, Tribal Nations, and people who have been historically marginalized. Our Mission in Action: We seek to enroll candidates who most align with our mission and have similar goals to serve all WA communities, especially rural, Tribal nations, and those who have been historically marginalized. Below are some examples of how we enact our mission. Admissions: • Holistic Review: Our admissions process truly balances an applicant’s experiences and attributes with their metrics in alignment with our mission. Once a threshold combination of GPA and MCAT have been met for a secondary, we blind these metrics – no one ever sees MCAT and GPAs! . • Focus on WA: We consider only those who have ties to/residency in WA. We ultimately hope our graduates will choose to practice in and care for WA communities. • Experiences with rural and/or underserved communities: one of the key experiences we are looking for are those who come from or have experience with these communities. Student Affairs: • Financial education: Between 40-50% of our student body comes from low socioeconomically backgrounds. It is important that we have resources to support them. On our Student Affairs team, we have a Director for Financial Education who meets with students each year to build a plan for debt management. This provides our students with the insights to select a career specialty choice based on their passion rather than their debt. • Our student interest groups include those focused on the broad diversity including Student National Medical Student Association, Latino Medical Student Association, Women in Medicine, Military medicine, Non-Traditional Students, and LGBTQI+ Interest Group. • We partner with the WSU Spokane Office of Native American Health Sciences who helps support our American Indian and Alaska Native students. https://spokane.wsu.edu/about/community-outreach/native-american-health-sciences/. They also have a Center for Native American Health: https://spokane.wsu.edu/native-health/center-for-native-american-health/ Curriculum, Assessment, and Learning Support: • Rural/Urban Underserved Rotation: In Year 4, all students are required to complete a rural underserved or urban underserved 4-week rotation as a graduation requirement. • Community-based medical school within a Land Grant institution: As a community-based medical school, we train our students across Washington and within diverse communities including rural, underserved, tribal clinics, and urban clinic/hospitals. This provides our students with broad exposure to diverse populations in WA to help inform them of the challenging health care problems that exist.https://medicine.wsu.edu/community/ • Coaching: Every student will be assigned a faculty academic coach; one for the pre-clerkship years and one for the clerkship years. This serves to further support our students toward self-regulation and improvement. We also provide students with a USMLE Step 1 Coach. More info about our Student Learning Center: https://medicine.wsu.edu/about/departments-units/student-learning-center/ Graduates: • We will have graduates that leave the state for their residency training. We hope based on their connections to the state they will return to care for WA communities, especially those that are rural and underserved.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Medical College of Wisconsin",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Institutional Mission Statement: To be a national leader in the education and development of the next generation of physicians and scientists, to discover and translate new knowledge in the biomedical sciences, to provide cutting edge interdisciplinary and compassionate clinical care of the highest quality and to improve the health of the communities we serve. Many new aspects of the MCWfusion Curriculum stem directly from our mission. Doctoring Threads create opportunities for students to obtain the knowledge, skills and attitudes required to be successful clinicians. Spiral Weeks allow students to create and act on individual development plans for excellence and remediation and develop meaningful connections with peers and faculty. Learning Communities will become a longitudinal support system during medical school. Students will interact with a small group of peers and a faculty navigator while nurturing their adaptive learner skills and obtaining academic advising and coaching. A goal specific to MCW-Green Bay and MCW-Central Wisconsin is to contribute to ameliorating predicted physician shortfalls in primary care. Thus, the three-year curriculum option available at those campuses emphasizes those specialties needed for providing primary care where shortages have been identified including primarily family medicine and psychiatry. Students attending MCW-Green Bay and MCW-Central Wisconsin should have a deep interest in practicing in Wisconsin and serving the needs across the state.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "University of Wisconsin School of Medicine and Public Health",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Mission: Together, we are advancing health and health equity through remarkable service to patients and communities, outstanding education, and innovative research. Vision: Healthy people. Healthy communities. Values: * Integrity and Accountability – Every person, every action, every time. * Compassion – Treat all with kindness, understanding, and empathy. * Social Impact and Belonging – Advance health and health equity by respecting the rights, dignity, and differences of all. * Excellence – Strive for the very best in all we do.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Marshall University Joan C. Edwards School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Marshall University Joan C. Edwards School of Medicine is a community-based, Veterans Affairs affiliated medical school dedicated to providing high quality medical education and postgraduate training programs to foster a skilled physician workforce to meet the unique healthcare needs of West Virginia and Central Appalachia. Building upon its medical education foundation, the school seeks to develop centers of excellence in clinical care, including primary care in rural underserved areas as well as focused and responsive programs of biomedical science graduate study, biomedical and clinical science research, academic scholarship and public service outreach. The School is committed to fulfilling its mission by creating a diverse and inclusive academic community that is sustained in a collegial and nurturing environment of life-long learning.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "West Virginia University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Improving the health and wellbeing of everyone we serve",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "University of British Columbia Faculty of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The University of British Columbia’s MD Undergraduate Program strives to deliver exemplary distributed medical education that prepares future physicians to collaborate with patients and their circle of support in providing culturally safe, high-quality healthcare for the diverse and changing populations in BC and beyond, including Indigenous Peoples, people living in rural and remote communities, and those who disproportionately experience adverse outcomes in health care*. Our graduates are prepared to engage with diverse communities and to embrace generalist or specialist postgraduate training to further prepare them for medical practice and to contribute innovative improvements to healthcare in BC and globally. The Program is grounded in the Faculty of Medicine’s vision “Transforming Health for Everyone,” and embodies the values of respect, integrity, compassion, collaboration and equity. *People who disproportionately experience adverse outcomes in healthcare include but are not limited to those experiencing inequity due to their race, ethnicity, religion, spiritual beliefs, gender identity, gender expression, sexuality, socioeconomic status, or other markers of human diversity; older adults living with complex health conditions; newcomers to Canada, people whose first language is not English; people living with disabilities and/or chronic health needs, including people living with mental illness and people who use substances.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Max Rady College of Medicine, Rady Faculty of Health Sciences, University of Manitoba",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "- To develop, deliver and evaluate high quality educational programs for undergraduate and postgraduate students of medicine and medical rehabilitation, for graduate students and postdoctoral fellows in basic medical sciences and for physicians to practice. - To conduct research and other scholarly enquiry into the basic and applied medical sciences. - To provide advice, disseminate information to health professions and plan for the development and delivery of health care services and to help improve health status and service delivery to the Province of Manitoba and the wider community.",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Memorial University of Newfoundland Faculty of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To meet the unique health needs of the communities we serve and advance population health through integrated excellence in education, research, scholarship and social responsibility. To admit a culturally and socioeconomically diverse group of applicants who demonstrate academic and personal excellence, and who exhibit multidimensional interests and personal qualities that position them to succeed in the undergraduate medical education program and ultimately meet the health needs of the diverse communities we serve.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Dalhousie University Faculty of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The mission of Dalhousie University's Faculty of Medicine is to drive excellence in health and health care through world-class medical education and research, and our commitment to social accountability. The Faculty of Medicine is responsible for providing a program of undergraduate medical study such that graduates have the knowledge, skills, professional behaviours and attitudes necessary to enter the supervised practice of medicine in Canada",
    "primary_category": "The Leader"
  },
  {
    "school_name": "McMaster University Michael G. DeGroote School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "\"Together, Advancing Health Through Learning and Discovery.\"",
    "primary_category": "The Investigator"
  },
  {
    "school_name": "Northern Ontario School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To improve the health of Northern Ontarians by being socially accountable in our education and research programs and advocating for health equity. We will realize this by: • Embedding social accountability as a core value in graduates. NOSM will be a recognized leader in rural and Northern health knowledge and will influence and advocate for policy advances in health at all levels of government. • Increasing research capacity and expertise in population-based health to improve advocacy and evidence-based policy in Northern Ontario. NOSM will have a positive research impact on Northern health, be known as the leader in Northern health research and increase grant and other research funding. • Incorporating advanced technology into curriculum and day-to-day activities of the School. NOSM will be a leader in educational excellence through its curriculum renewal, competency-based training, adaptive technology, and will meet or exceed all accreditation standards. • Being a strong active partner with communities in need to create a flourishing health workforce to serve the North. • Securing sustainable financial and human resources to deliver on our vision of innovative education and research. We will be financially sustainable by ensuring access to resources and infrastructure to sustain and grow NOSM through efficiencies and a culture of advancement. • Creating a sustainable working and learning environment. NOSM will commit to diversity, wellness and respect for faculty, staff and learners.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "Queen's University Faculty of Health Sciences",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "As educational leaders delivering innovative interprofessional curriculum, we train compassionate, resilient physicians to the highest calibre who will help change the future of healthcare in their communities. We train physicians who are prepared to address health equity and access issues, and to champion the needs of equity-deserving groups through practice informed by the principles of generalism and interprofessional collaboration.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "The University of Western Ontario - Schulich School of Medicine & Dentistry",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Schulich School of Medicine & Dentistry provides outstanding education within a research-intensive environment where tomorrow's physicians, dentists, and health researchers learn to be socially responsible leaders in the advancement of human health.",
    "primary_category": "The Leader"
  },
  {
    "school_name": "Toronto Metropolitan University School of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The School of Medicine is dedicated to improving the health and well-being of individuals, families and communities across Ontario and Canada, with a focus on the primary care needs of diverse and medically underserved populations, through community-engaged education, scholarship and service. We are committed to educating students to become compassionate, respectful and future-ready clinicians who provide outstanding holistic health care and who lead in health system transformation. We strive for equity in all that we do. We commit to Truth, Reconciliation, anti-racism and justice to achieve inclusion and optimal health for all.",
    "primary_category": "The Advocate"
  },
  {
    "school_name": "University of Ottawa Faculty of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "To expand our impact on the health of individuals and populations in both official languages through interdisciplinary education, research and responsive care.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "Universite de Montreal Faculty of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "The Faculty of Medicine of the Université de Montréal seeks through its undergraduate medical program to provide medical knowledge, clinical skills and professional attitudes so that students will be able to enter postgraduate training in family medicine or medical specialization, or fields related to research, teaching, or health care management.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "Universite de Sherbrooke Faculty of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "Improve health and well-being of people and populations through education, research, clinical services, and knowledge transfer.",
    "primary_category": "The Practitioner"
  },
  {
    "school_name": "University of Saskatchewan College of Medicine",
    "degree_type": "MD",
    "application_system": "AMCAS",
    "mission_statement": "As a socially accountable organization, we improve health through innovative and interdisciplinary research and education, leadership, community engagement, and the development of culturally competent, skilled clinicians and scientists. Collaborative and mutually beneficial partnerships with Indigenous peoples and communities are central to our mission.",
    "primary_category": "The Advocate"
  }
]